app/views/users/show.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 11 AND "friendships"."friend_id" = 3 LIMIT 1
---
          <span class="button button-secondary"><i class="fa-solid fa-hourglass-half"></i> Friend Request Sent</span>
          <%= button_to '<i class="fa-solid fa-trash"></i> Cancel Request'.html_safe, friendship_path(current_user.friendships.find_by(friend: @user)), method: :delete, data: { confirm: "Are you sure?" }, class: "button button-danger" %>

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 5 LIMIT 1
---
          <span class="button button-secondary"><i class="fa-solid fa-user-group"></i> Friends</span>
          <%= button_to '<i class="fa-solid fa-trash"></i> Remove Friend'.html_safe, friendship_path(current_user.friendships.find_by(friend: @user) || current_user.inverse_friendships.find_by(user: @user)), method: :delete, data: { confirm: "Are you sure?" }, class: "button button-danger" %>