app/views/friendships/index.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 5 LIMIT 1
---
            <% end %>
            <%= button_to '<i class="fa-solid fa-trash"></i> Remove Friend'.html_safe, friendship_path(current_user.friendships.find_by(friend: friend) || current_user.inverse_friendships.find_by(user: friend)), method: :delete, data: { confirm: "Are you sure you want to remove #{friend.username}?" }, class: "button button-danger" %>