app/views/posts/_post.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT 1 AS one FROM "likes" WHERE "likes"."post_id" = 20 AND "likes"."user_id" = 11 LIMIT 1
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 19 AND "likes"."user_id" = 11 LIMIT 1
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 20
---
    <% if logged_in? %>
      <% if post.likes.exists?(user: current_user) %>
        <%= button_to '<i class="fa-solid fa-heart mr-2"></i> Unlike ('.html_safe + post.likes.count.to_s + ')', post_like_path(post, post.likes.find_by(user: current_user)), method: :delete, class: "inline-flex items-center justify-center whitespace-nowrap rounded-md text-sm font-medium ring-offset-background transition-colors focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-ring focus-visible:ring-offset-2 disabled:pointer-events-none disabled:opacity-50 bg-primary text-primary-foreground hover:bg-primary/90 h-9 px-3 py-1" %>
      <% else %>
        <%= button_to '<i class="fa-solid fa-heart mr-2"></i> Like ('.html_safe + post.likes.count.to_s + ')', post_likes_path(post), method: :post, class: "inline-flex items-center justify-center whitespace-nowrap rounded-md text-sm font-medium ring-offset-background transition-colors focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-ring focus-visible:ring-offset-2 disabled:pointer-events-none disabled:opacity-50 bg-primary text-primary-foreground hover:bg-primary/90 h-9 px-3 py-1" %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 19
---
    <%= link_to post_path(post), class: "inline-flex items-center justify-center whitespace-nowrap rounded-md text-sm font-medium ring-offset-background transition-colors focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-ring focus-visible:ring-offset-2 disabled:pointer-events-none disabled:opacity-50 bg-primary text-primary-foreground hover:bg-primary/90 h-9 px-3 py-1" do %>
      <i class="fa-solid fa-comment mr-2"></i> Comments (<%= post.comments.count %>)