app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (12, 19, 15, 17, 13, 18)
---
  def index
    @blogs = Blog.includes(:user).order(created_at: :desc)