app/controllers/community_memberships_controller.rb

  def create
    @membership = @community.community_memberships.build(user: current_user, status: 'pending')
    if @membership.save
---
INSERT INTO "community_memberships" ("user_id", "community_id", "status", "created_at", "updated_at") VALUES (12, 4, 'pending', '2025-07-30 04:54:38.711982', '2025-07-30 04:54:38.711982') RETURNING "id"

  def set_community
    @community = Community.find(params[:community_id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 4 LIMIT 1