app/controllers/communities_controller.rb

  def index
    @communities = Community.all.order(created_at: :desc)
---
SELECT "communities".* FROM "communities" ORDER BY "communities"."created_at" DESC

  def show
    @memberships = @community.community_memberships.accepted.includes(:user)
    @is_member = logged_in? ? @community.members.include?(current_user) : false
---
SELECT "community_memberships".* FROM "community_memberships" WHERE "community_memberships"."user_id" = 12 AND "community_memberships"."community_id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (16, 14)
SELECT 1 AS one FROM "users" INNER JOIN "community_memberships" ON "users"."id" = "community_memberships"."user_id" WHERE "community_memberships"."community_id" = 4 AND "users"."id" = 12 LIMIT 1

  def set_community
    @community = Community.find(params[:id])
---
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 4 LIMIT 1