app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ('nice', 3, 20, '2025-07-30 02:55:56.376890', '2025-07-30 02:55:56.376890') RETURNING "id"