app/controllers/friendships_controller.rb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 11 AND "friendships"."status" = 'accepted'
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 11)
---
  def index
    @accepted_friendships = current_user.friendships.where(status: 'accepted').includes(:friend)
    @friends = @accepted_friendships.map(&:friend) + current_user.inverse_friendships.where(status: 'accepted').includes(:user).map(&:user)

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 3 AND "friendships"."status" = 'pending'
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 11)
---
  def requests
    @incoming_requests = current_user.inverse_friendships.where(status: 'pending').includes(:user)

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES (11, 3, 'pending', '2025-07-30 02:54:25.646276', '2025-07-30 02:54:25.646276') RETURNING "id"
---
  def create
    friend = User.find(params[:friend_id])
    friendship = current_user.friendships.build(friend: friend, status: 'pending')
    if friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = 10 LIMIT 1
UPDATE "friendships" SET "status" = 'accepted', "updated_at" = '2025-07-30 02:55:14.893782' WHERE "friendships"."id" = 10
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES (3, 5, 'accepted', '2025-07-30 02:55:14.921097', '2025-07-30 02:55:14.921097') RETURNING "id"
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 3 AND "friendships"."friend_id" = 5 AND "friendships"."status" = 'accepted' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
  def update
    friendship = Friendship.find(params[:id])
    if friendship.friend == current_user && friendship.update(status: 'accepted')
      # Create inverse friendship for mutual acceptance
      current_user.friendships.find_or_create_by(friend: friendship.user, status: 'accepted')