app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (11, 19, '2025-07-30 02:54:32.664507', '2025-07-30 02:54:32.664507') RETURNING "id"
---
  def create
    @like = @post.likes.build(user: current_user)
    if @like.save