app/controllers/messages_controller.rb

  def index
    # Get all users current_user has messaged or been messaged by
    sent_to_users = current_user.sent_messages.pluck(:receiver_id)
    received_from_users = current_user.received_messages.pluck(:sender_id)
---
SELECT "messages"."sender_id" FROM "messages" WHERE "messages"."receiver_id" = 11