app/controllers/messages_controller.rb

  def show
    @messages = Message.where(
      "(sender_id = ? AND receiver_id = ?) OR (sender_id = ? AND receiver_id = ?)",
      current_user.id, @conversation_user.id, @conversation_user.id, current_user.id
    ).order(:created_at)

    # Mark messages as read
    @messages.where(receiver: current_user, read_at: nil).update_all(read_at: Time.current)
---
SELECT "messages".* FROM "messages" WHERE ((sender_id = 3 AND receiver_id = 8) OR (sender_id = 8 AND receiver_id = 3)) ORDER BY "messages"."created_at" ASC
UPDATE "messages" SET "read_at" = '2025-07-30 02:58:34.987820' WHERE ("messages"."id") IN (SELECT "messages"."id" FROM "messages" WHERE ((sender_id = 3 AND receiver_id = 8) OR (sender_id = 8 AND receiver_id = 3)) AND "messages"."receiver_id" = 3 AND "messages"."read_at" IS NULL ORDER BY "messages"."created_at" ASC)

  def create
    # Find the receiver from the form parameters
    receiver = User.find(message_params[:receiver_id])

    @message = current_user.sent_messages.build(message_params.except(:receiver_id))
    @message.receiver = receiver

    if @message.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
INSERT INTO "messages" ("sender_id", "receiver_id", "content", "read_at", "created_at", "updated_at") VALUES (3, 8, 'hello', NULL, '2025-07-30 03:06:55.358344', '2025-07-30 03:06:55.358344') RETURNING "id"

  def set_conversation_user
    @conversation_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1

  def set_conversation_users_list
    # Get all users current_user has messaged or been messaged by
    sent_to_users = current_user.sent_messages.pluck(:receiver_id)
    received_from_users = current_user.received_messages.pluck(:sender_id)

    @conversation_users = User.where(id: (sent_to_users + received_from_users).uniq)
                              .where.not(id: current_user.id)
                              .order(:username)
---
SELECT "messages"."sender_id" FROM "messages" WHERE "messages"."receiver_id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" IN (9, 8) AND "users"."id" != 3 ORDER BY "users"."username" ASC