app/controllers/pages_controller.rb

  def index
    @pages = Page.all.order(likes_count: :desc)
---
SELECT "pages".* FROM "pages" ORDER BY "pages"."likes_count" DESC