app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 19 ORDER BY "comments"."created_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (7, 10)
---
  def show
    @comment = Comment.new
    @comments = @post.comments.includes(:user).order(created_at: :asc)