app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "username", "bio", "avatar", "password_digest", "created_at", "updated_at") VALUES ('Gift Mkyelu', 'mkyelugift@gmail.com', 'GiftMk', '', 'https://plus.unsplash.com/premium_photo-1752192844251-b0bbb746ea49?w=800&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxmZWF0dXJlZC1waG90b3MtZmVlZHw1fHx8ZW58MHx8fHx8', '$2a$12$08mUt0KUn56exHqZ6eEuBO3nv.oDux9mz6N86ojDeOA510WgdrW4m', '2025-07-30 02:42:01.057302', '2025-07-30 02:42:01.057302') RETURNING "id"

  def show
    @posts = @user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 3 ORDER BY "posts"."created_at" DESC