app/models/user.rb

SELECT "users"."id" FROM "users" WHERE "users"."id" IN (4, 10)
---
  def all_friends
    # Get IDs of users who are friends (current_user is user_id, friend_id is friend)
    accepted_as_sender_ids = friendships.accepted.pluck(:friend_id)

    # Get IDs of users who are friends (current_user is friend_id, user_id is friend)
    accepted_as_receiver_ids = inverse_friendships.accepted.pluck(:user_id)

    # Combine and find unique users
    User.where(id: (accepted_as_sender_ids + accepted_as_receiver_ids).uniq)