app/models/user.rb

SELECT "friendships"."friend_id" FROM "friendships" WHERE "friendships"."user_id" = 12 AND "friendships"."status" = 'accepted'
SELECT "friendships"."user_id" FROM "friendships" WHERE "friendships"."friend_id" = 12 AND "friendships"."status" = 'accepted'
---
  def recommended_users(limit: 5)
    # Get IDs of current user, accepted friends, and users with pending requests (both ways)
    excluded_ids = [self.id] +
                   self.all_friends.pluck(:id) +
                   self.friendships.where(status: 'pending').pluck(:friend_id) +
                   self.inverse_friendships.where(status: 'pending').pluck(:user_id)