app/views/communities/_community.html.erb

SELECT "communities".* FROM "communities" ORDER BY "communities"."created_at" DESC
---
  <p class="community-meta">Created by <%= link_to community.creator.username, user_path(community.creator) %></p>
  <p class="community-meta"><%= community.members.count %> Members</p>