app/views/communities/show.html.erb

            <span class="inline-flex items-center justify-center whitespace-nowrap rounded-md text-sm font-medium ring-offset-background transition-colors focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-ring focus-visible:ring-offset-2 disabled:pointer-events-none disabled:opacity-50 bg-secondary text-secondary-foreground h-10 px-4 py-2"><i class="fa-solid fa-check mr-2"></i> Joined</span>
            <%= button_to '<i class="fa-solid fa-right-from-bracket mr-2"></i> Leave Community'.html_safe, community_community_membership_path(@community, current_user.community_memberships.find_by(community: @community)), method: :delete, data: { confirm: "Are you sure you want to leave this community?" }, class: "inline-flex items-center justify-center whitespace-nowrap rounded-md text-sm font-medium ring-offset-background transition-colors focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-ring focus-visible:ring-offset-2 disabled:pointer-events-none disabled:opacity-50 bg-destructive text-destructive-foreground hover:bg-destructive/90 h-10 px-4 py-2" %>
---
SELECT "community_memberships".* FROM "community_memberships" WHERE "community_memberships"."user_id" = 14 AND "community_memberships"."community_id" = 4 LIMIT 1